In [1]:
import pandas as pd

### Lesson 1

In [29]:
# loading data
X = pd.read_csv('sample.csv')

In [30]:
type(X)

pandas.core.frame.DataFrame

In [31]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
a    25 non-null object
1    25 non-null int64
dtypes: int64(1), object(1)
memory usage: 472.0+ bytes

In [32]:
X.head()

   a  1
0  b  2
1  c  3
2  d  4
3  e  5
4  f  6

### Lesson 2

In [33]:
M = X.as_matrix()
type(M)

C:\Program Files\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  if __name__ == '__main__':

numpy.ndarray

In [34]:
type(X.values)

numpy.ndarray

In [35]:
X['a']

0     b
1     c
2     d
3     e
4     f
5     g
6     h
7     i
8     j
9     k
10    l
11    m
12    n
13    o
14    p
15    q
16    r
17    s
18    t
19    u
20    v
21    w
22    x
23    y
24    z
Name: a, dtype: object

In [36]:
type(X['a'])

pandas.core.series.Series

In [37]:
X[X['1'] > 5]

    a   1
4   f   6
5   g   7
6   h   8
7   i   9
8   j  10
9   k  11
10  l  12
11  m  13
12  n  14
13  o  15
14  p  16
15  q  17
16  r  18
17  s  19
18  t  20
19  u  21
20  v  22
21  w  23
22  x  24
23  y  25
24  z  26

### Lesson 3

In [38]:
# renaming columns

X.columns = ['alphabets', 'numbers']

In [39]:
X.head()

  alphabets  numbers
0         b        2
1         c        3
2         d        4
3         e        5
4         f        6

In [40]:
# adding columns
X['Ones'] = 1
X.head()

  alphabets  numbers  Ones
0         b        2     1
1         c        3     1
2         d        4     1
3         e        5     1
4         f        6     1

### Lesson 4

In [41]:
X['numbers'] - X['Ones']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
dtype: int64

In [42]:
X['Twos'] = X['Ones'].apply(lambda row: row*2)
X.head()

  alphabets  numbers  Ones  Twos
0         b        2     1     2
1         c        3     1     2
2         d        4     1     2
3         e        5     1     2
4         f        6     1     2

### Lesson 4

In [43]:
X2 = X.copy()
X2.head()

  alphabets  numbers  Ones  Twos
0         b        2     1     2
1         c        3     1     2
2         d        4     1     2
3         e        5     1     2
4         f        6     1     2

In [45]:
X2 = X2.drop(['Twos'], axis=1)
X2.head()

  alphabets  numbers  Ones
0         b        2     1
1         c        3     1
2         d        4     1
3         e        5     1
4         f        6     1

In [46]:
X.merge(X2, on='alphabets')

   alphabets  numbers_x  Ones_x  Twos  numbers_y  Ones_y
0          b          2       1     2          2       1
1          c          3       1     2          3       1
2          d          4       1     2          4       1
3          e          5       1     2          5       1
4          f          6       1     2          6       1
5          g          7       1     2          7       1
6          h          8       1     2          8       1
7          i          9       1     2          9       1
8          j         10       1     2         10       1
9          k         11       1     2         11       1
10         l         12       1     2         12       1
11         m         13       1     2         13       1
12         n         14       1     2         14       1
13         o         15       1     2         15       1
14         p         16       1     2         16       1
15         q         17       1     2         17       1
16         r         18       1     2         18       1
17         s         19       1     2         19       1
18         t         20       1     2         20       1
19         u         21       1     2         21       1
20         v         22       1     2         22       1
21         w         23       1     2         23       1
22         x         24       1     2         24       1
23         y         25       1     2         25       1
24         z         26       1     2         26       1